MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l2/thirdparty/mspm0l2/ti/devices/msp/peripherals/hw_flashctl.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_flashctl__include
#define ti_devices_msp_peripherals_hw_flashctl__include

/* Filename: hw_flashctl.h */
/* Revised: 2023-05-04 09:46:28 */
/* Revision: 59e844638cbc4054026b3e132f05a3e05d70f5a2 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* FLASHCTL Registers
******************************************************************************/
#define FLASHCTL_GEN_OFS                         ((uint32_t)0x00000000U)


/** @addtogroup FLASHCTL_GEN
  @{
*/

typedef struct {
       uint32_t RESERVED0[1032];
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt Index Register */
       uint32_t RESERVED1;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt Mask Register */
       uint32_t RESERVED2;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw Interrupt Status Register */
       uint32_t RESERVED3;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked Interrupt Status Register */
       uint32_t RESERVED4;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt Set Register */
       uint32_t RESERVED5;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt Clear Register */
       uint32_t RESERVED6[37];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED7[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Hardware Version Description Register */
  __IO uint32_t CMDEXEC;                           /* !< (@ 0x00001100) Command Execute Register */
  __IO uint32_t CMDTYPE;                           /* !< (@ 0x00001104) Command Type Register */
  __IO uint32_t CMDCTL;                            /* !< (@ 0x00001108) Command Control Register */
       uint32_t RESERVED8[5];
  __IO uint32_t CMDADDR;                           /* !< (@ 0x00001120) Command Address Register */
  __IO uint32_t CMDBYTEN;                          /* !< (@ 0x00001124) Command Program Byte Enable Register */
       uint32_t RESERVED9;
  __IO uint32_t CMDDATAINDEX;                      /* !< (@ 0x0000112C) Command Data Index Register */
  __IO uint32_t CMDDATA0;                          /* !< (@ 0x00001130) Command Data Register 0 */
  __IO uint32_t CMDDATA1;                          /* !< (@ 0x00001134) Command Data Register 1 */
  __IO uint32_t CMDDATA2;                          /* !< (@ 0x00001138) Command Data Register 2 */
  __IO uint32_t CMDDATA3;                          /* !< (@ 0x0000113C) Command Data Register Bits 127:96 */
  __IO uint32_t CMDDATA4;                          /* !< (@ 0x00001140) Command Data Register 4 */
  __IO uint32_t CMDDATA5;                          /* !< (@ 0x00001144) Command Data Register 5 */
  __IO uint32_t CMDDATA6;                          /* !< (@ 0x00001148) Command Data Register 6 */
  __IO uint32_t CMDDATA7;                          /* !< (@ 0x0000114C) Command Data Register 7 */
  __IO uint32_t CMDDATA8;                          /* !< (@ 0x00001150) Command Data Register 8 */
  __IO uint32_t CMDDATA9;                          /* !< (@ 0x00001154) Command Data Register 9 */
  __IO uint32_t CMDDATA10;                         /* !< (@ 0x00001158) Command Data Register 10 */
  __IO uint32_t CMDDATA11;                         /* !< (@ 0x0000115C) Command Data Register 11 */
  __IO uint32_t CMDDATA12;                         /* !< (@ 0x00001160) Command Data Register 12 */
  __IO uint32_t CMDDATA13;                         /* !< (@ 0x00001164) Command Data Register 13 */
  __IO uint32_t CMDDATA14;                         /* !< (@ 0x00001168) Command Data Register 14 */
  __IO uint32_t CMDDATA15;                         /* !< (@ 0x0000116C) Command Data Register 15 */
  __IO uint32_t CMDDATA16;                         /* !< (@ 0x00001170) Command Data Register 16 */
  __IO uint32_t CMDDATA17;                         /* !< (@ 0x00001174) Command Data Register 17 */
  __IO uint32_t CMDDATA18;                         /* !< (@ 0x00001178) Command Data Register 18 */
  __IO uint32_t CMDDATA19;                         /* !< (@ 0x0000117C) Command Data Register 19 */
  __IO uint32_t CMDDATA20;                         /* !< (@ 0x00001180) Command Data Register 20 */
  __IO uint32_t CMDDATA21;                         /* !< (@ 0x00001184) Command Data Register 21 */
  __IO uint32_t CMDDATA22;                         /* !< (@ 0x00001188) Command Data Register 22 */
  __IO uint32_t CMDDATA23;                         /* !< (@ 0x0000118C) Command Data Register 23 */
  __IO uint32_t CMDDATA24;                         /* !< (@ 0x00001190) Command Data Register 24 */
  __IO uint32_t CMDDATA25;                         /* !< (@ 0x00001194) Command Data Register 25 */
  __IO uint32_t CMDDATA26;                         /* !< (@ 0x00001198) Command Data Register 26 */
  __IO uint32_t CMDDATA27;                         /* !< (@ 0x0000119C) Command Data Register 27 */
  __IO uint32_t CMDDATA28;                         /* !< (@ 0x000011A0) Command Data Register 28 */
  __IO uint32_t CMDDATA29;                         /* !< (@ 0x000011A4) Command Data Register 29 */
  __IO uint32_t CMDDATA30;                         /* !< (@ 0x000011A8) Command Data Register 30 */
  __IO uint32_t CMDDATA31;                         /* !< (@ 0x000011AC) Command Data Register 31 */
  __IO uint32_t CMDDATAECC0;                       /* !< (@ 0x000011B0) Command Data Register ECC 0 */
  __IO uint32_t CMDDATAECC1;                       /* !< (@ 0x000011B4) Command Data Register ECC 1 */
  __IO uint32_t CMDDATAECC2;                       /* !< (@ 0x000011B8) Command Data Register ECC 2 */
  __IO uint32_t CMDDATAECC3;                       /* !< (@ 0x000011BC) Command Data Register ECC 3 */
  __IO uint32_t CMDDATAECC4;                       /* !< (@ 0x000011C0) Command Data Register ECC 4 */
  __IO uint32_t CMDDATAECC5;                       /* !< (@ 0x000011C4) Command Data Register ECC 5 */
  __IO uint32_t CMDDATAECC6;                       /* !< (@ 0x000011C8) Command Data Register ECC 6 */
  __IO uint32_t CMDDATAECC7;                       /* !< (@ 0x000011CC) Command Data Register ECC 7 */
  __IO uint32_t CMDWEPROTA;                        /* !< (@ 0x000011D0) Command Write Erase Protect A Register */
  __IO uint32_t CMDWEPROTB;                        /* !< (@ 0x000011D4) Command Write Erase Protect B Register */
  __IO uint32_t CMDWEPROTC;                        /* !< (@ 0x000011D8) Command Write Erase Protect C Register */
       uint32_t RESERVED10[13];
  __IO uint32_t CMDWEPROTNM;                       /* !< (@ 0x00001210) Command Write Erase Protect Non-Main Register */
  __IO uint32_t CMDWEPROTTR;                       /* !< (@ 0x00001214) Command Write Erase Protect Trim Register */
  __IO uint32_t CMDWEPROTEN;                       /* !< (@ 0x00001218) Command Write Erase Protect Engr Register */
       uint32_t RESERVED11[101];
  __IO uint32_t CFGCMD;                            /* !< (@ 0x000013B0) Command Configuration Register */
  __IO uint32_t CFGPCNT;                           /* !< (@ 0x000013B4) Pulse Counter Configuration Register */
       uint32_t RESERVED12[6];
  __I  uint32_t STATCMD;                           /* !< (@ 0x000013D0) Command Status Register */
  __I  uint32_t STATADDR;                          /* !< (@ 0x000013D4) Address Status Register */
  __I  uint32_t STATPCNT;                          /* !< (@ 0x000013D8) Pulse Count Status Register */
  __I  uint32_t STATMODE;                          /* !< (@ 0x000013DC) Mode Status Register */
       uint32_t RESERVED13[4];
  __I  uint32_t GBLINFO0;                          /* !< (@ 0x000013F0) Global Information Register 0 */
  __I  uint32_t GBLINFO1;                          /* !< (@ 0x000013F4) Global Information Register 1 */
  __I  uint32_t GBLINFO2;                          /* !< (@ 0x000013F8) Global Information Register 2 */
       uint32_t RESERVED14;
  __I  uint32_t BANK0INFO0;                        /* !< (@ 0x00001400) Bank Information Register 0 for Bank 0 */
  __I  uint32_t BANK0INFO1;                        /* !< (@ 0x00001404) Bank Information Register 1 for Bank 0 */
       uint32_t RESERVED15[2];
  __I  uint32_t BANK1INFO0;                        /* !< (@ 0x00001410) Bank Information Register 0 for Bank 1 */
  __I  uint32_t BANK1INFO1;                        /* !< (@ 0x00001414) Bank Information Register 1 for Bank 1 */
       uint32_t RESERVED16[2];
  __I  uint32_t BANK2INFO0;                        /* !< (@ 0x00001420) Bank Information Register 0 for Bank 2 */
  __I  uint32_t BANK2INFO1;                        /* !< (@ 0x00001424) Bank Information Register 1 for Bank 2 */
       uint32_t RESERVED17[2];
  __I  uint32_t BANK3INFO0;                        /* !< (@ 0x00001430) Bank Information Register 0 for Bank 3 */
  __I  uint32_t BANK3INFO1;                        /* !< (@ 0x00001434) Bank Information Register 1 for Bank 3 */
       uint32_t RESERVED18[2];
  __I  uint32_t BANK4INFO0;                        /* !< (@ 0x00001440) Bank Information Register 0 for Bank 4 */
  __I  uint32_t BANK4INFO1;                        /* !< (@ 0x00001444) Bank Information Register 1 for Bank 4 */
} FLASHCTL_GEN_Regs;

/*@}*/ /* end of group FLASHCTL_GEN */

/** @addtogroup FLASHCTL
  @{
*/

