MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l2/thirdparty/mspm0l2/ti/devices/msp/peripherals/hw_flashctl.h
typedef struct {
  FLASHCTL_GEN_Regs  GEN;                               /* !< (@ 0x00000000) */
} FLASHCTL_Regs;

/*@}*/ /* end of group FLASHCTL */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* FLASHCTL Register Control Bits
******************************************************************************/

/* FLASHCTL_IIDX Bits */
/* FLASHCTL_IIDX[STAT] Bits */
#define FLASHCTL_IIDX_STAT_OFS                   (0)                             /* !< STAT Offset */
#define FLASHCTL_IIDX_STAT_MASK                  ((uint32_t)0x00000001U)         /* !< Indicates which interrupt has
                                                                                    fired. 0x0 means no event pending.
                                                                                    The priority order is fixed. On each
                                                                                    read, only one interrupt is
                                                                                    indicated. On a read, the current
                                                                                    interrupt (highest priority) is
                                                                                    automatically cleared by the hardware
                                                                                    and the corresponding interrupt flags
                                                                                    in the RIS and MIS are cleared as
                                                                                    well. After a read from the CPU (not
                                                                                    from the debug interface), the
                                                                                    register must be up2025-10-02d with the
                                                                                    next highest priority interrupt. */
#define FLASHCTL_IIDX_STAT_NO_INTR               ((uint32_t)0x00000000U)         /* !< No Interrupt Pending */
#define FLASHCTL_IIDX_STAT_DONE                  ((uint32_t)0x00000001U)         /* !< DONE Interrupt Pending */

/* FLASHCTL_IMASK Bits */
/* FLASHCTL_IMASK[DONE] Bits */
#define FLASHCTL_IMASK_DONE_OFS                  (0)                             /* !< DONE Offset */
#define FLASHCTL_IMASK_DONE_MASK                 ((uint32_t)0x00000001U)         /* !< Interrupt mask for DONE: 0:
                                                                                    Interrupt is disabled in MIS register
                                                                                    1: Interrupt is enabled in MIS
                                                                                    register */
#define FLASHCTL_IMASK_DONE_DISABLED             ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define FLASHCTL_IMASK_DONE_ENABLED              ((uint32_t)0x00000001U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in [IPSTANDARD.MIS] will be set */

/* FLASHCTL_RIS Bits */
/* FLASHCTL_RIS[DONE] Bits */
#define FLASHCTL_RIS_DONE_OFS                    (0)                             /* !< DONE Offset */
#define FLASHCTL_RIS_DONE_MASK                   ((uint32_t)0x00000001U)         /* !< Flash wrapper operation completed.
                                                                                    This interrupt bit is set by firmware
                                                                                    or the corresponding bit in the ISET
                                                                                    register. It is cleared by the
                                                                                    corresponding bit in in the ICLR
                                                                                    register or reading the IIDX register
                                                                                    when this interrupt is the highest
                                                                                    priority. */
#define FLASHCTL_RIS_DONE_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define FLASHCTL_RIS_DONE_SET                    ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* FLASHCTL_MIS Bits */
/* FLASHCTL_MIS[DONE] Bits */
#define FLASHCTL_MIS_DONE_OFS                    (0)                             /* !< DONE Offset */
#define FLASHCTL_MIS_DONE_MASK                   ((uint32_t)0x00000001U)         /* !< Flash wrapper operation completed.
                                                                                    This masked interrupt bit reflects
                                                                                    the bitwise AND of the corresponding
                                                                                    RIS and IMASK bits. */
#define FLASHCTL_MIS_DONE_CLR                    ((uint32_t)0x00000000U)         /* !< Masked interrupt did not occur */
#define FLASHCTL_MIS_DONE_SET                    ((uint32_t)0x00000001U)         /* !< Masked interrupt occurred */

/* FLASHCTL_ISET Bits */
/* FLASHCTL_ISET[DONE] Bits */
#define FLASHCTL_ISET_DONE_OFS                   (0)                             /* !< DONE Offset */
#define FLASHCTL_ISET_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< 0: No effect 1: Set the DONE
                                                                                    interrupt in the RIS register */
#define FLASHCTL_ISET_DONE_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define FLASHCTL_ISET_DONE_SET                   ((uint32_t)0x00000001U)         /* !< Set [IPSTANDARD.RIS] bit */

/* FLASHCTL_ICLR Bits */
/* FLASHCTL_ICLR[DONE] Bits */
#define FLASHCTL_ICLR_DONE_OFS                   (0)                             /* !< DONE Offset */
#define FLASHCTL_ICLR_DONE_MASK                  ((uint32_t)0x00000001U)         /* !< 0: No effect 1: Clear the DONE
                                                                                    interrupt in the RIS register */
#define FLASHCTL_ICLR_DONE_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define FLASHCTL_ICLR_DONE_CLR                   ((uint32_t)0x00000001U)         /* !< Clear [IPSTANDARD.RIS] bit */

/* FLASHCTL_EVT_MODE Bits */
/* FLASHCTL_EVT_MODE[INT0_CFG] Bits */
#define FLASHCTL_EVT_MODE_INT0_CFG_OFS           (0)                             /* !< INT0_CFG Offset */
#define FLASHCTL_EVT_MODE_INT0_CFG_MASK          ((uint32_t)0x00000003U)         /* !< Event line mode select for
                                                                                    peripheral event */
#define FLASHCTL_EVT_MODE_INT0_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define FLASHCTL_EVT_MODE_INT0_CFG_SOFTWARE      ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define FLASHCTL_EVT_MODE_INT0_CFG_HARDWARE      ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. Hardware must clear
                                                                                    the RIS. */

/* FLASHCTL_DESC Bits */
/* FLASHCTL_DESC[MINREV] Bits */
#define FLASHCTL_DESC_MINREV_OFS                 (0)                             /* !< MINREV Offset */
#define FLASHCTL_DESC_MINREV_MASK                ((uint32_t)0x0000000FU)         /* !< Minor Revision */
#define FLASHCTL_DESC_MINREV_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MINREV_MAXIMUM             ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* FLASHCTL_DESC[MAJREV] Bits */
#define FLASHCTL_DESC_MAJREV_OFS                 (4)                             /* !< MAJREV Offset */
#define FLASHCTL_DESC_MAJREV_MASK                ((uint32_t)0x000000F0U)         /* !< Major Revision */
#define FLASHCTL_DESC_MAJREV_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MAJREV_MAXIMUM             ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* FLASHCTL_DESC[INSTNUM] Bits */
#define FLASHCTL_DESC_INSTNUM_OFS                (8)                             /* !< INSTNUM Offset */
#define FLASHCTL_DESC_INSTNUM_MASK               ((uint32_t)0x00000F00U)         /* !< Instance number */
#define FLASHCTL_DESC_INSTNUM_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_INSTNUM_MAXIMUM            ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* FLASHCTL_DESC[FEATUREVER] Bits */
#define FLASHCTL_DESC_FEATUREVER_OFS             (12)                            /* !< FEATUREVER Offset */
#define FLASHCTL_DESC_FEATUREVER_MASK            ((uint32_t)0x0000F000U)         /* !< Feature set */
#define FLASHCTL_DESC_FEATUREVER_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define FLASHCTL_DESC_FEATUREVER_MAXIMUM         ((uint32_t)0x0000F000U)         /* !< Maximum Value */
/* FLASHCTL_DESC[MODULEID] Bits */
#define FLASHCTL_DESC_MODULEID_OFS               (16)                            /* !< MODULEID Offset */
#define FLASHCTL_DESC_MODULEID_MASK              ((uint32_t)0xFFFF0000U)         /* !< Module ID */
#define FLASHCTL_DESC_MODULEID_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define FLASHCTL_DESC_MODULEID_MAXIMUM           ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* FLASHCTL_CMDEXEC Bits */
/* FLASHCTL_CMDEXEC[VAL] Bits */
#define FLASHCTL_CMDEXEC_VAL_OFS                 (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDEXEC_VAL_MASK                ((uint32_t)0x00000001U)         /* !< Command Execute value Initiates
                                                                                    execution of the command specified in
                                                                                    the CMDTYPE register. */
#define FLASHCTL_CMDEXEC_VAL_NOEXECUTE           ((uint32_t)0x00000000U)         /* !< Command will not execute or is not
                                                                                    executing in flash wrapper */
#define FLASHCTL_CMDEXEC_VAL_EXECUTE             ((uint32_t)0x00000001U)         /* !< Command will execute or is
                                                                                    executing in flash wrapper */

/* FLASHCTL_CMDTYPE Bits */
/* FLASHCTL_CMDTYPE[COMMAND] Bits */
#define FLASHCTL_CMDTYPE_COMMAND_OFS             (0)                             /* !< COMMAND Offset */
#define FLASHCTL_CMDTYPE_COMMAND_MASK            ((uint32_t)0x00000007U)         /* !< Command type */
#define FLASHCTL_CMDTYPE_COMMAND_NOOP            ((uint32_t)0x00000000U)         /* !< No Operation */
#define FLASHCTL_CMDTYPE_COMMAND_PROGRAM         ((uint32_t)0x00000001U)         /* !< Program */
#define FLASHCTL_CMDTYPE_COMMAND_ERASE           ((uint32_t)0x00000002U)         /* !< Erase */
#define FLASHCTL_CMDTYPE_COMMAND_READVERIFY      ((uint32_t)0x00000003U)         /* !< ReadVerify - Perform a standalone
                                                                                    ReadVerify operation. */
#define FLASHCTL_CMDTYPE_COMMAND_MODECHANGE      ((uint32_t)0x00000004U)         /* !< Mode Change - Perform a mode change
                                                                                    only, no other operation. */
#define FLASHCTL_CMDTYPE_COMMAND_CLEARSTATUS     ((uint32_t)0x00000005U)         /* !< Clear Status - Clear status bits in
                                                                                    FW_SMSTAT only. */
#define FLASHCTL_CMDTYPE_COMMAND_BLANKVERIFY     ((uint32_t)0x00000006U)         /* !< Blank Verify - Check whether a
                                                                                    flash word is in the erased state.
                                                                                    This command may only be used with
                                                                                    CMDTYPE.SIZE = ONEWORD */
/* FLASHCTL_CMDTYPE[SIZE] Bits */
#define FLASHCTL_CMDTYPE_SIZE_OFS                (4)                             /* !< SIZE Offset */
#define FLASHCTL_CMDTYPE_SIZE_MASK               ((uint32_t)0x00000070U)         /* !< Command size */
#define FLASHCTL_CMDTYPE_SIZE_ONEWORD            ((uint32_t)0x00000000U)         /* !< Operate on 1 flash word */
#define FLASHCTL_CMDTYPE_SIZE_TWOWORD            ((uint32_t)0x00000010U)         /* !< Operate on 2 flash words */
#define FLASHCTL_CMDTYPE_SIZE_FOURWORD           ((uint32_t)0x00000020U)         /* !< Operate on 4 flash words */
#define FLASHCTL_CMDTYPE_SIZE_EIGHTWORD          ((uint32_t)0x00000030U)         /* !< Operate on 8 flash words */
#define FLASHCTL_CMDTYPE_SIZE_SECTOR             ((uint32_t)0x00000040U)         /* !< Operate on a flash sector */
#define FLASHCTL_CMDTYPE_SIZE_BANK               ((uint32_t)0x00000050U)         /* !< Operate on an entire flash bank */

/* FLASHCTL_CMDCTL Bits */
/* FLASHCTL_CMDCTL[MODESEL] Bits */
#define FLASHCTL_CMDCTL_MODESEL_OFS              (0)                             /* !< MODESEL Offset */
#define FLASHCTL_CMDCTL_MODESEL_MASK             ((uint32_t)0x0000000FU)         /* !< Mode This field is only used for
                                                                                    the Mode Change command type.
                                                                                    Otherwise, bank and pump modes are
                                                                                    set automaticlly through the NW
                                                                                    hardware. */
#define FLASHCTL_CMDCTL_MODESEL_READ             ((uint32_t)0x00000000U)         /* !< Read Mode */
#define FLASHCTL_CMDCTL_MODESEL_RDMARG0          ((uint32_t)0x00000002U)         /* !< Read Margin 0 Mode */
#define FLASHCTL_CMDCTL_MODESEL_RDMARG1          ((uint32_t)0x00000004U)         /* !< Read Margin 1 Mode */
#define FLASHCTL_CMDCTL_MODESEL_RDMARG0B         ((uint32_t)0x00000006U)         /* !< Read Margin 0B Mode */
#define FLASHCTL_CMDCTL_MODESEL_RDMARG1B         ((uint32_t)0x00000007U)         /* !< Read Margin 1B Mode */
#define FLASHCTL_CMDCTL_MODESEL_PGMVER           ((uint32_t)0x00000009U)         /* !< Program Verify Mode */
#define FLASHCTL_CMDCTL_MODESEL_PGMSW            ((uint32_t)0x0000000AU)         /* !< Program Single Word */
#define FLASHCTL_CMDCTL_MODESEL_ERASEVER         ((uint32_t)0x0000000BU)         /* !< Erase Verify Mode */
#define FLASHCTL_CMDCTL_MODESEL_ERASESECT        ((uint32_t)0x0000000CU)         /* !< Erase Sector */
#define FLASHCTL_CMDCTL_MODESEL_PGMMW            ((uint32_t)0x0000000EU)         /* !< Program Multiple Word */
#define FLASHCTL_CMDCTL_MODESEL_ERASEBNK         ((uint32_t)0x0000000FU)         /* !< Erase Bank */
/* FLASHCTL_CMDCTL[BANKSEL] Bits */
#define FLASHCTL_CMDCTL_BANKSEL_OFS              (4)                             /* !< BANKSEL Offset */
#define FLASHCTL_CMDCTL_BANKSEL_MASK             ((uint32_t)0x000001F0U)         /* !< Bank Select A specific Bank ID can
                                                                                    be written to this field to indicate
                                                                                    to which bank an  operation is to be
                                                                                    applied if CMDCTL.ADDRXLATEOVR is
                                                                                    set. */
#define FLASHCTL_CMDCTL_BANKSEL_BANK0            ((uint32_t)0x00000010U)         /* !< Bank 0 */
#define FLASHCTL_CMDCTL_BANKSEL_BANK1            ((uint32_t)0x00000020U)         /* !< Bank 1 */
#define FLASHCTL_CMDCTL_BANKSEL_BANK2            ((uint32_t)0x00000040U)         /* !< Bank 2 */
#define FLASHCTL_CMDCTL_BANKSEL_BANK3            ((uint32_t)0x00000080U)         /* !< Bank 3 */
#define FLASHCTL_CMDCTL_BANKSEL_BANK4            ((uint32_t)0x00000100U)         /* !< Bank 4 */
/* FLASHCTL_CMDCTL[REGIONSEL] Bits */
#define FLASHCTL_CMDCTL_REGIONSEL_OFS            (9)                             /* !< REGIONSEL Offset */
#define FLASHCTL_CMDCTL_REGIONSEL_MASK           ((uint32_t)0x00001E00U)         /* !< Bank Region A specific region ID
                                                                                    can be written to this field to
                                                                                    indicate to which region an
                                                                                    operation is to be applied if
                                                                                    CMDCTL.ADDRXLATEOVR is set. */
#define FLASHCTL_CMDCTL_REGIONSEL_MAIN           ((uint32_t)0x00000200U)         /* !< Main Region */
#define FLASHCTL_CMDCTL_REGIONSEL_NONMAIN        ((uint32_t)0x00000400U)         /* !< Non-Main Region */
#define FLASHCTL_CMDCTL_REGIONSEL_TRIM           ((uint32_t)0x00000800U)         /* !< Trim Region */
#define FLASHCTL_CMDCTL_REGIONSEL_ENGR           ((uint32_t)0x00001000U)         /* !< Engr Region */
/* FLASHCTL_CMDCTL[ECCGENOVR] Bits */
#define FLASHCTL_CMDCTL_ECCGENOVR_OFS            (17)                            /* !< ECCGENOVR Offset */
#define FLASHCTL_CMDCTL_ECCGENOVR_MASK           ((uint32_t)0x00020000U)         /* !< Override hardware generation of ECC
                                                                                    data for program.  Use data written
                                                                                    to  CMDDATAECC*. */
#define FLASHCTL_CMDCTL_ECCGENOVR_NOOVERRIDE     ((uint32_t)0x00000000U)         /* !< Do not override */
#define FLASHCTL_CMDCTL_ECCGENOVR_OVERRIDE       ((uint32_t)0x00020000U)         /* !< Override */
/* FLASHCTL_CMDCTL[ADDRXLATEOVR] Bits */
#define FLASHCTL_CMDCTL_ADDRXLATEOVR_OFS         (16)                            /* !< ADDRXLATEOVR Offset */
#define FLASHCTL_CMDCTL_ADDRXLATEOVR_MASK        ((uint32_t)0x00010000U)         /* !< Override hardware address
                                                                                    translation of address in CMDADDR
                                                                                    from a  system address to a bank
                                                                                    address and bank ID.  Use data
                                                                                    written to  CMDADDR directly as the
                                                                                    bank address.  Use the value written
                                                                                    to  CMDCTL.BANKSEL directly as the
                                                                                    bank ID.  Use the value written to
                                                                                    CMDCTL.REGIONSEL directly as the
                                                                                    region ID. */
#define FLASHCTL_CMDCTL_ADDRXLATEOVR_NOOVERRIDE  ((uint32_t)0x00000000U)         /* !< Do not override */
#define FLASHCTL_CMDCTL_ADDRXLATEOVR_OVERRIDE    ((uint32_t)0x00010000U)         /* !< Override */
/* FLASHCTL_CMDCTL[SSERASEDIS] Bits */
#define FLASHCTL_CMDCTL_SSERASEDIS_OFS           (20)                            /* !< SSERASEDIS Offset */
#define FLASHCTL_CMDCTL_SSERASEDIS_MASK          ((uint32_t)0x00100000U)         /* !< Disable Stair-Step Erase.  If set,
                                                                                    the default VHV trim voltage setting
                                                                                    will be used for all erase pulses. By
                                                                                    default, this bit is reset, meaning
                                                                                    that the VHV voltage will be stepped
                                                                                    during successive erase pulses.  The
                                                                                    step count, step voltage, begin and
                                                                                    end voltages are all hard-wired. */
#define FLASHCTL_CMDCTL_SSERASEDIS_ENABLE        ((uint32_t)0x00000000U)         /* !< Enable */
#define FLASHCTL_CMDCTL_SSERASEDIS_DISABLE       ((uint32_t)0x00100000U)         /* !< Disable */
/* FLASHCTL_CMDCTL[DATAVEREN] Bits */
#define FLASHCTL_CMDCTL_DATAVEREN_OFS            (21)                            /* !< DATAVEREN Offset */
#define FLASHCTL_CMDCTL_DATAVEREN_MASK           ((uint32_t)0x00200000U)         /* !< Enable invalid data verify.   This
                                                                                    checks for 0->1 transitions in the
                                                                                    memory when a program operation is
                                                                                    initiated.  If such a transition is
                                                                                    found, the program will fail with an
                                                                                    error without executing the program. */
#define FLASHCTL_CMDCTL_DATAVEREN_DISABLE        ((uint32_t)0x00000000U)         /* !< Disable */
#define FLASHCTL_CMDCTL_DATAVEREN_ENABLE         ((uint32_t)0x00200000U)         /* !< Enable */

/* FLASHCTL_CMDADDR Bits */
/* FLASHCTL_CMDADDR[VAL] Bits */
#define FLASHCTL_CMDADDR_VAL_OFS                 (0)                             /* !< VAL Offset */
#define FLASHCTL_CMDADDR_VAL_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Address value */
#define FLASHCTL_CMDADDR_VAL_MINIMUM             ((uint32_t)0x00000000U)         /* !< Minimum value of [VAL] */
#define FLASHCTL_CMDADDR_VAL_MAXIMUM             ((uint32_t)0xFFFFFFFFU)         /* !< Maximum value of [VAL] */

